[
    {
      "id": 1,
      "term": "Модель",
      "definition": "Модель машинного обучения — это формальная функция, которая по входным данным выдаёт прогноз или решение. Её параметры подбираются в процессе обучения так, чтобы как можно лучше описывать зависимость между признаками и целевой переменной.",
      "related": ["Функция потерь", "Признаки", "Гиперпараметр", "Пространство признаков"]
    },
    {
      "id": 2,
      "term": "Датасет",
      "definition": "Датасет — это набор данных, собранных в едином формате для обучения и оценки моделей. Он обычно состоит из объектов (строк), их признаков и, при наличии учителя, целевых значений.",
      "related": ["Обучающая выборка", "Тестовая выборка", "Признаки", "Целевая переменная"]
    },
    {
      "id": 3,
      "term": "Признак",
      "definition": "Признак — измеримая характеристика объекта, по которой модель принимает решение: число, категория, флаг и т.п. Набор всех признаков формирует вектор, представляющий объект в математическом пространстве.",
      "related": ["Пространство признаков", "Нормализация признаков", "Инженерия признаков"]
    },
    {
      "id": 4,
      "term": "Целевая переменная",
      "definition": "Целевая переменная (label) — это значение, которое модель должна предсказать: класс, количество, вероятность. При обучении с учителем она задана в данных и служит ориентиром для настройки параметров модели.",
      "related": ["Обучение с учителем", "Функция потерь", "Классификация", "Регрессия"]
    },
    {
      "id": 5,
      "term": "Обучение с учителем",
      "definition": "Обучение с учителем — режим, когда для каждого объекта в датасете известна целевая переменная, и модель учится приближать эту зависимость. Классические задачи здесь — классификация и регрессия.",
      "related": ["Целевая переменная", "Функция потерь", "Классификация", "Регрессия"]
    },
    {
      "id": 6,
      "term": "Обучение без учителя",
      "definition": "Обучение без учителя — это обучение на данных без целевой переменной, когда алгоритм сам ищет скрытую структуру: группы, направления вариаций, аномалии. Целью становится не прогноз, а упорядочивание и сжатие информации.",
      "related": ["Кластеризация", "Снижение размерности", "Аномалии", "Пространство признаков"]
    },
    {
      "id": 7,
      "term": "Обучение с подкреплением",
      "definition": "Обучение с подкреплением — парадигма, где агент взаимодействует со средой, совершает действия и получает награду. Модель учится стратегии, максимизирующей суммарную ожидаемую награду во времени.",
      "related": ["Политика", "Функция ценности", "Марковский процесс", "Эксплорейшн–эксплойтейшн"]
    },
    {
      "id": 8,
      "term": "Функция потерь",
      "definition": "Функция потерь измеряет, насколько текущие предсказания модели расходятся с целевыми значениями. Обучение сводится к минимизации этой функции по параметрам модели с помощью численных методов оптимизации.",
      "related": ["Градиентный спуск", "Метрика качества", "Регуляризация", "Обучение с учителем"]
    },
    {
      "id": 9,
      "term": "Метрика качества",
      "definition": "Метрика качества — численная мера, по которой оценивают полезность и точность модели на новых данных. В отличие от функции потерь, метрика ориентирована на прикладной смысл задачи, например точность, полнота или RMSE.",
      "related": ["Функция потерь", "Тестовая выборка", "Кросс-валидация", "Классификация"]
    },
    {
      "id": 10,
      "term": "Переобучение",
      "definition": "Переобучение — состояние, когда модель слишком хорошо подгоняется под обучающие данные и теряет способность обобщать на новые примеры. Обычно это проявляется высоким качеством на обучении и заметно худшим — на тесте.",
      "related": ["Регуляризация", "Кросс-валидация", "Сложность модели", "Обучающая выборка"]
    },
    {
      "id": 11,
      "term": "Регуляризация",
      "definition": "Регуляризация — приём, который добавляет к функции потерь штраф за излишнюю сложность модели или большие веса. Он помогает бороться с переобучением и делает поведение модели более устойчивым на новых данных.",
      "related": ["Переобучение", "L1-регуляризация", "L2-регуляризация", "Гиперпараметр"]
    },
    {
      "id": 12,
      "term": "Кросс-валидация",
      "definition": "Кросс-валидация — способ оценки модели, при котором данные многократно делят на обучающие и валидационные части и усредняют результат. Это позволяет более надёжно измерять качество и подбирать гиперпараметры.",
      "related": ["Валидационная выборка", "Метрика качества", "Гиперпараметр", "Переобучение"]
    },
    {
      "id": 13,
      "term": "Градиентный спуск",
      "definition": "Градиентный спуск — базовый алгоритм оптимизации, который изменяет параметры модели в направлении, уменьшающем функцию потерь. Шаг изменения задаётся скоростью обучения и повторяется многократно по данным.",
      "related": ["Функция потерь", "Скорость обучения", "Стохастический градиентный спуск", "Эпоха обучения"]
    },
    {
      "id": 14,
      "term": "Гиперпараметр",
      "definition": "Гиперпараметр — настройка алгоритма обучения или структуры модели, которая не подбирается автоматически по градиенту. К ним относятся, например, глубина дерева, скорость обучения, сила регуляризации.",
      "related": ["Кросс-валидация", "Регуляризация", "Скорость обучения", "Поиск по сетке"]
    },
    {
      "id": 15,
      "term": "Обучающая, валидационная и тестовая выборки",
      "definition": "Обучающая выборка используется для подгонки параметров модели, валидационная — для подбора гиперпараметров и ранней остановки, тестовая — для финальной независимой оценки качества. Разделение защищает от самообмана.",
      "related": ["Датасет", "Кросс-валидация", "Метрика качества", "Переобучение"]
    },
    {
      "id": 16,
      "term": "Батч (пакет) данных",
      "definition": "Батч — это подмножество объектов из обучающей выборки, по которому за один шаг обновляются параметры модели. Работа с батчами ускоряет обучение на больших датасетах и делает градиентные оценки более стабильными.",
      "related": ["Стохастический градиентный спуск", "Эпоха обучения", "Градиентный спуск", "Обучающая выборка"]
    },
    {
      "id": 17,
      "term": "Эпоха обучения",
      "definition": "Эпоха обучения — один полный проход модели по всей обучающей выборке (или по всем батчам). Количество эпох задаёт, насколько долго модель обучается, и влияет как на качество, так и на риск переобучения.",
      "related": ["Батч", "Градиентный спуск", "Ранняя остановка", "Обучающая выборка"]
    },
    {
      "id": 18,
      "term": "Нормализация признаков",
      "definition": "Нормализация признаков — преобразование данных так, чтобы масштабы разных признаков стали сопоставимыми, например приведение к нулевому среднему и единичному стандартному отклонению. Это облегчает оптимизацию и ускоряет сходимость.",
      "related": ["Признаки", "Пространство признаков", "Градиентный спуск", "Стандартизация"]
    },
    {
      "id": 19,
      "term": "Пространство признаков",
      "definition": "Пространство признаков — абстрактное математическое пространство, в котором каждый объект представлен вектором признаков. Форма и размерность этого пространства определяют, какие зависимости модель в принципе может уловить.",
      "related": ["Признак", "Снижение размерности", "Ядровые методы", "Обучение без учителя"]
    },
    {
      "id": 20,
      "term": "Линейная модель",
      "definition": "Линейная модель описывает целевую переменную как линейную комбинацию признаков, возможно после простых преобразований. Она служит базовой отправной точкой в машинном обучении и часто даёт интерпретируемые коэффициенты.",
      "related": ["Линейная регрессия", "Логистическая регрессия", "Регуляризация", "Пространство признаков"]
    },
    {
      "id": 21,
      "term": "Дерево решений",
      "definition": "Дерево решений — модель, которая последовательно делит пространство признаков на области с помощью простых правил вида «если–то». В листьях дерева хранятся предсказания, а путь по ветвям даёт наглядную логику решения.",
      "related": ["Случайный лес", "Градиентный бустинг", "Переобучение", "Гиперпараметр"]
    },
    {
      "id": 22,
      "term": "Конволюция",
      "definition": "Конволюция — операция свёртки, при которой маленький фильтр последовательно проходит по данным (часто по изображению) и вычисляет локальные отклики. Она позволяет автоматически выделять устойчивые пространственные шаблоны и текстуры.",
      "related": ["Сверточные сети", "Фильтр", "Карта признаков", "Пространство признаков"]
    }
  ]
  